In [7]:
import pandas as pd
from env import host, username, password
import prepare
import wrangle
import warnings
warnings.filterwarnings("ignore")
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from scipy.stats import pearsonr, spearmanr

In [3]:
def get_zillow_data():
    """
    This function connects to the zillow database and retrieves data from the properties_2017 table for
    all 'Single Family Residential' properties. The resulting DataFrame contains the bedroomcnt, bathroomcnt,
    calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, and fips columns and is returned by
    the function.
    """
   
    # create the connection url
    url = f'mysql+pymysql://{username}:{password}@{host}/zillow'

    # read the SQL query into a DataFrame
    query = '''
            SELECT bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, fips
            FROM properties_2017
            WHERE propertylandusetypeid = 261
            '''
    df = pd.read_sql(query, url)

    return df

In [4]:
get_zillow_data().head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [8]:
df = get_zillow_data()

In [9]:
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [10]:
def split_data(df):
    """
    This function takes in the cleaned and scaled DataFrame and does the following:
    - Splits the data into train, validate, and test sets (60/20/20 split)
    - Returns the train, validate, and test sets
    """
    
    # Split the data into train and test sets (80/20 split)
    train, test = train_test_split(df, test_size=0.2, random_state=123)
    
    # Split the train set into train and validate sets (75/25 split)
    train, validate = train_test_split(train, test_size=0.25, random_state=123)
    
    # Return the train, validate, and test sets
    return train, validate, test

In [12]:
train, validate, test = split_data(df)

print("Train Head:")
print(train.head())

print("Validate Size:", validate.shape[0])
print("Test Size:", test.shape[0])

Train Head:
         bedroomcnt  bathroomcnt  calculatedfinishedsquarefeet  \
1228108         3.0          2.0                        1350.0
99712           3.0          1.0                        1048.0
1489629         2.0          1.0                         754.0
730173          4.0          1.5                        1248.0
579338          2.0          1.0                        1147.0

         taxvaluedollarcnt  yearbuilt  taxamount    fips
1228108           368552.0     1971.0    4323.38  6111.0
99712             445000.0     1935.0    5611.39  6037.0
1489629            91912.0     1952.0    1681.97  6037.0
730173             57374.0     1962.0     899.08  6059.0
579338            498000.0     1952.0    5950.70  6059.0
Validate Size: 430573
Test Size: 430573